[
    {
        "sl_number": 1,
        "url": "https://apple.com",
        "content": "Apple\nApple\nAppleStoreMaciPadiPhoneWatchVisionAirPodsTV & HomeEntertainmentAccessoriesSupport\n0+\nThe Apple Store Shopping Event\nGet an Apple Gift Card up to $200 with your eligible purchase.1\nOffer starts 11.24\nGet an early look\nHomePod mini\nLearn more\nBuy\nApple TV Plus\nMonarch: Legacy of Monsters\nSome secrets cannot be contained.\nStream the new series\niPhone 15 Pro\nTitanium. So strong. So light. So Pro.\nLearn more\nBuy\nApple Watch Series 9\nSmarter. Brighter. Mightier.\nLearn more\nBuy\nMacBook Pro\nMind-blowing. Head-turning.\nLearn more\nBuy\nWonder awaits.\nGive the gifts they’ve been looking forward to all year.\nShop\niPhone 15\nNew camera. New design. Newphoria.\nLearn more\nBuy\nApple Card\nGet up to 3% Daily Cash back with every purchase.\nLearn more\nApply now\nApply now\nApple Trade In\nGet $200-$650 in credit when you trade in iPhone 11 or higher.2\nSee what your device is worth\nApple Footer\n1. Offer valid on qualifying purchases of Eligible Products from November 24, 2023, to November 27, 2023, at a Qualifying Location. Offer subject to availability. While supplies last. Qualifying purchasers can receive a discount equal to the value of the Promotion Product (depending on their purchase) off the price of the Eligible Product, but will be charged for all items in their cart. Important notice regarding the checkout receipt and monthly statement for Apple Card Monthly Installments (ACMI) purchases with this promotion: A purchase of an Eligible Product made when selecting ACMI (a 0% APR payment option available only in the U.S.) as the payment type at checkout will receive an instant credit equal to the cost of the Promotion Product (Apple Gift Card) deducted from the price of the Eligible Product at the time of purchase. You will be charged one ACMI installment plan for the Eligible Product discounted by the instant credit. The value of the Promotion Product (i.e., the value of the Apple Gift Card) will also be charged in a separate second ACMI installment plan for the same number of months as the discounted Eligible Product. The total combined amount charged over the 2 separate ACMI installment plans will reflect the original full retail price of the Eligible Product. Separately, you will receive and be charged for the Promotion Product (Apple Gift Card) in the amount of the applicable instant credit. ACMI is a 0% APR payment option that is only available if you select it at checkout in the U.S. for eligible Apple products purchased at Apple Store locations, apple.com, the Apple Store app, or by calling 1-800-MY-APPLE, and is subject to credit approval and credit limit. See support.apple.com/kb/HT211204 for more information about eligible products. APR ranges may vary based on when you accepted an Apple Card. Cardholders who accept an Apple Card on and/or after August 10, 2023: Variable APRs for Apple Card, other than ACMI, range from 19.24% to 29.49% based on creditworthiness. Rates as of August 10, 2023. Existing cardholders: See your Customer Agreement for applicable rates and fee. If you buy an ACMI-eligible product by choosing to pay in full with Apple Card (instead of using ACMI), that purchase is subject to the Apple Card variable APR, not 0% APR. Taxes and shipping on ACMI purchases are subject to the variable APR, not 0% APR. You’ll need to select AT&T, T-Mobile, or Verizon as your carrier when you check out. An iPhone purchased with ACMI is always unlocked, so you can switch carriers at any time. ACMI is not available for purchases made online at the following special stores: Apple Employee Purchase Plan; participating corporate Employee Purchase Programs; Apple at Work for small businesses; Government, and Veterans and Military Purchase Programs, or on refurbished devices. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See support.apple.com/kb/HT211204 for information about upcoming changes to ACMI financing. See the Apple Card Customer Agreement for more information about ACMI financing. Apple Card is issued by Goldman Sachs Bank USA, Salt Lake City Branch. Available for qualifying applicants in the United States. If you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about accessing this offer or applying for Apple Card. Except for ACMI, this offer cannot be combined with other Apple promotions or financing offers that are directed to individual end-user customers in the Qualifying Location. This offer also cannot be combined with the Apple Employee Purchase Plan or business loyalty pricing. Some methods of payment are not accepted under this offer. See checkout for details. Additional restrictions apply. View full terms and conditions of offer here.\n2. Trade-in values will vary based on the condition, year, and configuration of your eligible trade-in device. Not all devices are eligible for credit. You must be at least 18 years old to be eligible to trade in for credit or for an Apple Gift Card. Trade-in value may be applied toward qualifying new device purchase, or added to an Apple Gift Card. Actual value awarded is based on receipt of a qualifying device matching the description provided when estimate was made. Sales tax may be assessed on full value of a new device purchase. In-store trade-in requires presentation of a valid photo ID (local law may require saving this information). Offer may not be available in all stores, and may vary between in-store and online trade-in. Some stores may have additional requirements. Apple or its trade-in partners reserve the right to refuse or limit quantity of any trade-in transaction for any reason. More details are available from Apple’s trade-in partner for trade-in and recycling of eligible devices. Restrictions and limitations may apply.\nTo access and use all Apple Card features and products available only to Apple Card users, you must add Apple Card to Wallet on an iPhone or iPad that supports and has the latest version of iOS or iPadOS. Apple Card is subject to credit approval, available only for qualifying applicants in the United States, and issued by Goldman Sachs Bank USA, Salt Lake City Branch. \nIf you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about Apple Card.\nLearn more about how Apple Card applications are evaluated at support.apple.com/kb/HT209218.\nShop and Learn\nShop and Learn\n+\nStore\nMac\niPad\niPhone\nWatch\nVision\nAirPods\nTV & Home\nAirTag\nAccessories\nGift Cards\nApple Wallet\nApple Wallet\n+\nWallet\nApple Card\nApple Pay\nApple Cash\nAccount\nAccount\n+\nManage Your Apple ID\nApple Store Account\niCloud.com\nEntertainment\nEntertainment\n+\nApple One\nApple TV+\nApple Music\nApple Arcade\nApple Fitness+\nApple News+\nApple Podcasts\nApple Books\nApp Store\nApple Store\nApple Store\n+\nFind a Store\nGenius Bar\nToday at Apple\nApple Camp\nApple Store App\nCertified Refurbished\nApple Trade In\nFinancing\nCarrier Deals at Apple\nOrder Status\nShopping Help\nFor Business\nFor Business\n+\nApple and Business\nShop for Business\nFor Education\nFor Education\n+\nApple and Education\nShop for K-12\nShop for College\nFor Healthcare\nFor Healthcare\n+\nApple in Healthcare\nHealth on Apple Watch\nHealth Records on iPhone\nFor Government\nFor Government\n+\nShop for Government\nShop for Veterans and Military\nApple Values\nApple Values\n+\nAccessibility\nEducation\nEnvironment\nInclusion and Diversity\nPrivacy\nRacial Equity and Justice\nSupplier Responsibility\nAbout Apple\nAbout Apple\n+\nNewsroom\nApple Leadership\nCareer Opportunities\nInvestors\nEthics & Compliance\nEvents\nContact Apple\n\t\t\tMore ways to shop: Find an Apple Store or other retailer near you. Or call 1-800-MY-APPLE.\nUnited States\nCopyright ©\n\t\t\t\t2023\n\t\t\t\t Apple Inc. All rights reserved.\nPrivacy Policy\nTerms of Use\nSales and Refunds\nLegal\nSite Map"
    },
    {
        "sl_number": 3,
        "url": "https://apple.com/us/shop/goto/store",
        "content": "Apple Store Online - Apple\nApple\nStore\nMac\niPad\niPhone\nWatch\nVision\nAirPods\nTV & Home\nEntertainment\nAccessories\nSupport\n0+\nStore.\nThe holidays are here. Wonder awaits.\n                                                                            Mac\n                                                                            iPhone\n                                                                            iPad\n                                                                            Apple Watch\n                                                                            AirPods\n                                                                            AirTag\n                                                                            Apple TV 4K\n                                                                            HomePod\n                                                                            Accessories\n                                                                            Apple Gift Card\nThe latest.\nGifts for that special everyone.\n                                                                            NEW\n                                                                            iPhone 15 Pro\n        From $999\n or $41.62/mo. per month  for 24 mo.monthsFootnote*\n                                                                            NEW\n                                                                            Apple Watch Series 9\n        From $399\n or  $33.25/mo.  per month  for 12 mo.monthsFootnote †\n                                                                            NEW\n                                                                            MacBook Pro\n        From $1599\n or  $133.25/mo.  per month  for 12 mo.monthsFootnote ††\n                                                                            NEW\n                                                                            iPhone 15\n        From $799\n or $33.29/mo. per month  for 24 mo.monthsFootnote*\n                                                                            iPad\n        From $449\n or  $37.41/mo.  per month  for 12 mo.monthsFootnote †\n                                                                            NEW\n                                                                            Apple Watch Ultra 2\n        From $799\n or  $66.58/mo.  per month  for 12 mo.monthsFootnote †\n                                                                            MacBook Air\n        From $1299\n or  $108.25/mo.  per month  for 12 mo.monthsFootnote †\n                                                                            iPad Air\n        From $599\n or  $49.91/mo.  per month  for 12 mo.monthsFootnote †\n                                                                            Apple Watch SE\n        From $249\n or  $20.75/mo.  per month  for 12 mo.monthsFootnote †\nOnly at Apple.\nThe perfect place to enjoy the holidays.\nTHE APPLE STORE SHOPPING EVENT\nBuy an eligible product and get an Apple Gift Card.***\nEvent begins November 24.Only at Apple.\nEnjoy two-hour delivery from an Apple Store, free delivery, or easy pickup.²\nFree extended returns between now and 1/8/24.⁴\nTrade in your current device. Get credit toward a new one.3\nPay in full or pay over time. Your choice.\n                                                                            HOLIDAY GIFT DELIVERY\n                                                                            Get your holiday gifts on time.  See when to order.\n                                                                            Dial up the joy.\n                                                                            Choose a case. Pick a band. Create an Apple Watch they can call their own.\n                                                                            Customize your Mac.\n\tBuild it just the way you want. Choose your memory, storage, graphics, even color.\n                                                                            APPLE SPECIALIST\nGet help finding gifts in a store or online. \nShop with a Specialist over video to find the perfect gift.\n                                                                            TODAY AT APPLE\n                                                                            Join free sessions at your Apple Store.\n                                                                            Learn about the latest features and how to go further with your Apple devices.\nThe Apple experience.\nEven more wonder in store.\n                                                                            Get 6 months of Apple Music free. \nIncluded with your HomePod, AirPods, or select Beats product.⁺ \n                                                                            APPLE TV+\n                                                                            Get 3 months of\nApple TV+ free when\nyou buy an Apple device.°\nSix Apple services. One easy subscription.\n                                                                            We’ve got you covered.\n                                                                            AppleCare+ now comes with unlimited repairs for accidental damage protection.\n                                                                            Discover all the ways to use Apple Pay.\n                                                                            HOME\nSee how one app can control your entire home.\nSpecial savings.\niPhone carrier deals and exclusive savings for school, businesses, and more.\n                                                                            CARRIER TRADE-IN DEALS\n                                                                            iPhone carrier deals. Right here at Apple. For as low as $0.¹\n                                                                            Includes trade-in and carrier credits. AT&T: up to $1000. T-Mobile: up to $1000. Verizon: up to $830.\n                                                                            EDUCATION\n                                                                            Save on Mac or iPad with education pricing.1\n                                                                            BUSINESS\nFrom enterprise to small business, we’ll work with you.1\n                                                                            GOVERNMENT\n                                                                            Special pricing is available for state, local, and federal agencies.1\n                                                                            VETERANS AND MILITARY\n                                                                            Active and veteran members may be eligible for exclusive savings.1\n                                                                            CERTIFIED REFURBISHED\n                                                                            Shop refurbished Apple products backed by a one‑year warranty.\nQuick Links\nOrder Status \nShopping Help \nReturns \nYour Saves \n* Pricing for iPhone 15 and iPhone 15 Plus includes a $30 connectivity discount that requires activation with AT&T, T-Mobile, or Verizon. Available to qualified customers and requires 24-month installment loan when you select Citizens One or Apple Card Monthly Installments (ACMI) as payment type at checkout at Apple. You’ll need to select AT&T, T-Mobile, or Verizon as your carrier when you check out.  An iPhone purchased with ACMI is always unlocked, so you can switch carriers at any time. Subject to credit approval and credit limit. Taxes and shipping are not included in ACMI and are subject to your card’s variable APR. Additional Apple Card Monthly Installments terms are in the Apple Card Customer Agreement (Opens in a new window). Additional iPhone Payments terms are here (Opens in a new window). ACMI is not available for purchases made online at special storefronts. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See https://support.apple.com/kb/HT211204 (Opens in a new window) for information about upcoming changes to ACMI financing.\n*** Offer valid on qualifying purchases of Eligible Products from November 24, 2023, to November 27, 2023, at a Qualifying Location. Offer subject to availability. While supplies last. Qualifying purchasers can receive a discount equal to the value of the Promotion Product (depending on their purchase) off the price of the Eligible Product, but will be charged for all items in their cart. Important notice regarding the checkout receipt and monthly statement for Apple Card Monthly Installments (ACMI) purchases with this promotion: A purchase of an Eligible Product made when selecting ACMI (a 0% APR payment option available only in the U.S.) as the payment type at checkout will receive an instant credit equal to the cost of the Promotion Product (Apple Gift Card) deducted from the price of the Eligible Product at the time of purchase. You will be charged one ACMI installment plan for the Eligible Product discounted by the instant credit. The value of the Promotion Product (i.e., the value of the Apple Gift Card) will also be charged in a separate second ACMI installment plan for the same number of months as the discounted Eligible Product. The total combined amount charged over the 2 separate ACMI installment plans will reflect the original full retail price of the Eligible Product. Separately, you will receive and be charged for the Promotion Product (Apple Gift Card) in the amount of the applicable instant credit. ACMI is a 0% APR payment option that is only available if you select it at checkout in the U.S. for eligible Apple products purchased at Apple Store locations, apple.com, the Apple Store app, or by calling 1-800-MY-APPLE, and is subject to credit approval and credit limit. See https://support.apple.com/kb/HT211204 for more information about eligible products. APR ranges may vary based on when you accepted an Apple Card. Cardholders who accept an Apple Card on and/or after August 10, 2023: Variable APRs for Apple Card, other than ACMI, range from 19.24% to 29.49% based on creditworthiness. Rates as of August 10, 2023. Existing cardholders: See your Customer Agreement for applicable rates and fee. If you buy an ACMI eligible product by choosing to pay in full with Apple Card (instead of using ACMI), that purchase is subject to the Apple Card variable APR, not 0% APR. Taxes and shipping on ACMI purchases are subject to the variable APR, not 0% APR. You’ll need to select AT&T, T-Mobile, or Verizon as your carrier when you check out for iPhone. An iPhone purchased with ACMI is always unlocked, so you can switch carriers at any time. ACMI is not available for purchases made online at the following special stores: Apple Employee Purchase Plan; participating corporate Employee Purchase Programs; Apple at Work for small businesses; Government, and Veterans and Military Purchase Programs, or on refurbished devices. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See https://support.apple.com/kb/HT211204 for information about upcoming changes to ACMI financing. See the Apple Card Customer Agreement for more information about ACMI financing. Apple Card is issued by Goldman Sachs Bank USA, Salt Lake City Branch. Available for qualifying applicants in the United States. If you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about accessing this offer or applying for Apple Card. Except for ACMI, this offer cannot be combined with other Apple promotion(s) or financing offers that are directed to individual end-user customers in the Qualifying Location. This offer also cannot be combined with the Apple Employee Purchase Plan or business loyalty pricing. Some methods of payment are not accepted  under this offer. See checkout for details. Additional restrictions apply. View full terms and conditions of offer here.\n◊ Apple Card Monthly Installments (ACMI) is a 0% APR payment option that is only available if you select it at checkout in the U.S. for eligible Apple products purchased at Apple Store locations, apple.com (Opens in a new window), the Apple Store app, or by calling 1-800-MY-APPLE, and is subject to credit approval and credit limit. See Apple Support (Opens in a new window) for more information about eligible products. APR ranges may vary based on when you accepted an Apple Card. Cardholders who accept an Apple Card on and/or after August 10, 2023: Variable APRs for Apple Card, other than ACMI, range from 19.24% to 29.49% based on creditworthiness. Rates as of August 10, 2023. Existing cardholders: See your Customer Agreement for applicable rates and fee. If you buy an ACMI-eligible product by choosing to pay in full with Apple Card (instead of using ACMI), that purchase is subject to the Apple Card variable APR, not 0% APR. Taxes and shipping on ACMI purchases are subject to the variable APR, not 0% APR. You’ll need to select AT&T, T-Mobile, or Verizon as your carrier when you check out. An iPhone purchased with ACMI is always unlocked, so you can switch carriers at any time. ACMI is not available for purchases made online at the following special stores: Apple Employee Purchase Plan; participating corporate Employee Purchase Programs; Apple at Work for small businesses; Government, and Veterans and Military Purchase Programs, or on refurbished devices. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See Apple Support (Opens in a new window) for information about upcoming changes to ACMI financing. See the Apple Card Customer Agreement (Opens in a new window) for more information about ACMI financing.\nTo access and use all Apple Card features and products available only to Apple Card users, you must add Apple Card to Wallet on an iPhone or iPad that supports and has the latest version of iOS or iPadOS. Apple Card is subject to credit approval, available only for qualifying applicants in the United States, and issued by Goldman Sachs Bank USA, Salt Lake City Branch.\nIf you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about Apple Card.\n† Monthly pricing is available when you select Apple Card Monthly Installments (ACMI) as payment type at checkout at Apple, and is subject to credit approval and credit limit. Financing terms vary by product. Taxes and shipping are not included in ACMI and are subject to your card’s variable APR. See the Apple Card Customer Agreement (Opens in a new window) for more information. ACMI is not available for purchases made online at special storefronts. The last month’s payment for each product will be the product's purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See https://support.apple.com/kb/HT211204 (Opens in a new window) for information about upcoming changes to ACMI financing.\n†† Price shown refers to MacBook Pro with M3 chip. Monthly pricing is available when you select Apple Card Monthly Installments (ACMI) as payment type at checkout at Apple, and is subject to credit approval and credit limit. Financing terms vary by product. Taxes and shipping are not included in ACMI and are subject to your card’s variable APR. See the Apple Card Customer Agreement (Opens in a new window) for more information. ACMI is not available for purchases made online at special storefronts. The last month’s payment for each product will be the product's purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See https://support.apple.com/kb/HT211204 (Opens in a new window) for information about upcoming changes to ACMI financing.\n° New and qualified returning subscribers only. $9.99/month after free trial. Only one offer per Apple ID and only one offer per family if you’re part of a Family Sharing group, regardless of the number of devices you or your family purchases. This offer is not available if you or your Family have previously accepted an Apple TV+ three months free or one year free offer. Offer good for 3 months after eligible device is activated. Plan automatically renews until cancelled. Restrictions and other terms apply.\n1. Special pricing available to qualified customers. To learn more about how to start qualifying toward special pricing, talk to an Apple Specialist in a store or give us a call at 1‑800‑MY‑APPLE.\n2. $9 two-hour delivery on eligible Apple products in most metros. Offer is not available on customized Mac, engraved products, and for certain order types including orders paid for with financing or by bank transfer. Delivery times vary according to your selected delivery address, availability of your items, and the time of day you place your order. Find a store to view local store hours or see checkout for estimated delivery. A signature is required for delivery. Drivers may ask for verbal confirmation of receipt from a safe distance to satisfy the signature requirement. See  https://www.apple.com/shop/shipping-pickup/ for more information.\n3. Trade‑in values will vary based on the condition, year, and configuration of your eligible trade‑in device. Not all devices are eligible for credit. You must be at least the age of majority to be eligible to trade in for credit or for an Apple Gift Card. Trade‑in value may be applied toward qualifying new device purchase, or added to an Apple Gift Card. Actual value awarded is based on receipt of a qualifying device matching the description provided when estimate was made. Sales tax may be assessed on full value of a new device purchase. In‑store trade‑in requires presentation of a valid photo ID (local law may require saving this information). Offer may not be available in all stores, and may vary between in-store and online trade‑in. Some stores may have additional requirements. Apple or its trade‑in partners reserve the right to refuse, cancel, or limit quantity of any trade‑in transaction for any reason. More details are available from Apple’s trade‑in partner for trade‑in and recycling of eligible devices. Restrictions and limitations may apply.\n4. iPhone purchases that are carrier financed with T-Mobile are not eligible and are subject to standard return policy.\n⁺ New subscribers only. $10.99/month after trial. Offer available for a limited time to new subscribers who connect an eligible device to an Apple device running iOS 15 or iPadOS 15 or later. Offer good for 3 months after eligible device pairing. No audio product purchase necessary for current owners of eligible devices. Plan automatically renews until cancelled. Restrictions and other terms apply.\n                We approximate your location from your internet IP address by matching it to a geographic region or from the location entered during your previous visit to Apple.\nFooter\nApple\nApple Store Online\n            Shop and Learn\nShop and Learn\nShop and Learn\n                    Store\n                    Mac\n                    iPad\n                    iPhone\n                    Watch\n                    Vision\n                    AirPods\n                    TV & Home\n                    AirTag\n                    Accessories\n                    Gift Cards\n            Apple Wallet\nApple Wallet\nApple Wallet\n                    Wallet\n                    Apple Card\n                    Apple Pay\n                    Apple Cash\n            Account\nAccount\nAccount\n                    Manage Your Apple ID\n                    Apple Store Account\n                    iCloud.com\n            Entertainment\nEntertainment\nEntertainment\n                    Apple One\n                    Apple TV+\n                    Apple Music\n                    Apple Arcade\n                    Apple Fitness+\n                    Apple News+ \n                    Apple Podcasts\n                    Apple Books\n                    App Store\n            Apple Store\nApple Store\nApple Store\n                    Find a Store\n                    Genius Bar\n                    Today at Apple\n                    Apple Camp\n                    Apple Store App\n                    Certified Refurbished\n                    Apple Trade In\n                    Financing\n                    Carrier Deals at Apple\n                    Order Status\n                    Shopping Help\n            For Business\nFor Business\nFor Business\n                    Apple and Business\n                    Shop for Business\n            For Education\nFor Education\nFor Education\n                    Apple and Education\n                    Shop for K-12\n                    Shop for College\n            For Healthcare\nFor Healthcare\nFor Healthcare\n                    Apple in Healthcare\n                    Health on Apple Watch\n                    Health Records on iPhone\n            For Government\nFor Government\nFor Government\n                    Shop for Government\n                    Shop for Veterans and Military\n            Apple Values\nApple Values\nApple Values\n                    Accessibility\n                    Education\n                    Environment\n                    Inclusion and Diversity\n                    Privacy\n                    Racial Equity and Justice\n                    Supplier Responsibility\n            About Apple\nAbout Apple\nAbout Apple\n                    Newsroom\n                    Apple Leadership\n                    Career Opportunities\n                    Investors\n                    Ethics & Compliance\n                    Events\n                    Contact Apple\nMore ways to shop: Find an Apple Store or other retailer near you. Or call 1‑800‑MY‑APPLE.\n                            United States\n                    Copyright © 2023 Apple Inc.  All rights reserved.\nPrivacy Policy \nTerms of Use \nSales and Refunds \nLegal \nSite Map "
    }
]